xiaxquan/Tradition_DTU/FTU/bsp/stm32f429-apollo/applications/calculator/calculator.c
/**
  *             Copyright (C) SOJO Electric CO., Ltd. 2017-2018. All right reserved.
  * @file:      calculator.c
  * @brief:     The calculator application.
  * @version:   V1.0.0 
  * @author:    Mr.Sun
  * @date:      2017-10-26
  * @update:    [2017-12-07][Lexun][make the code cleanup]
  */
	
/* INCLUDE FILES -------------------------------------------------------------*/
#include "stm32f429xx.h"
#include "calculator.h"
#include "common_data.h"
#include "wave_recording.h"
#include <math.h>
#include <arm_math.h>


/* PUBLIC VARIABLES ----------------------------------------------------------*/
// U-I 角度
float g_Alpha[ALPHA_NUM];

/* PRIVATE VARIABLES ---------------------------------------------------------*/
static arm_cfft_radix2_instance_f32 Scfft;

static float FFT_InputBufUa[CALC_TIMES][FFT_LENGTH * 2]; // FFT输入数组 存储FFT=所用临时变量
static float FFT_InputBufUb[CALC_TIMES][FFT_LENGTH * 2];
static float FFT_InputBufUc[CALC_TIMES][FFT_LENGTH * 2];
static float FFT_InputBufU0[CALC_TIMES][FFT_LENGTH * 2];
static float FFT_InputBufIa[CALC_TIMES][FFT_LENGTH * 2];
static float FFT_InputBufIb[CALC_TIMES][FFT_LENGTH * 2];
static float FFT_InputBufIc[CALC_TIMES][FFT_LENGTH * 2];
static float FFT_InputBufI0[CALC_TIMES][FFT_LENGTH * 2];
static float FFT_InputBufUA[CALC_TIMES][FFT_LENGTH * 2];	
static float FFT_InputBufUC[CALC_TIMES][FFT_LENGTH * 2];

// 计算三次的模值
static float VUa[CALC_TIMES], VUb[CALC_TIMES], VUc[CALC_TIMES], VU0[CALC_TIMES];
static float VIa[CALC_TIMES], VIb[CALC_TIMES], VIc[CALC_TIMES], VI0[CALC_TIMES];
//static float VPa[CALC_TIMES], VPb[CALC_TIMES], VPc[CALC_TIMES];
//static float VQa[CALC_TIMES], VQb[CALC_TIMES], VQc[CALC_TIMES];
//static float VSa[CALC_TIMES], VSb[CALC_TIMES], VSc[CALC_TIMES];
static float VUa3[CALC_TIMES],VUb3[CALC_TIMES],VUc3[CALC_TIMES],VU03[CALC_TIMES]; // 电压三次谐波
static float VUa5[CALC_TIMES],VUb5[CALC_TIMES],VUc5[CALC_TIMES],VU05[CALC_TIMES]; // 电压五次谐波
static float VUA[CALC_TIMES], VUC[CALC_TIMES];
static float VUC3[CALC_TIMES]; // 电压三次谐波
static float VUC5[CALC_TIMES]; // 电压五次谐波
static float VIa2[CALC_TIMES],VIb2[CALC_TIMES],VIc2[CALC_TIMES]; // 电流二次谐波
static float VIa3[CALC_TIMES],VIb3[CALC_TIMES],VIc3[CALC_TIMES],VI03[CALC_TIMES]; // 电流三次谐波
static float VIa5[CALC_TIMES],VIb5[CALC_TIMES],VIc5[CALC_TIMES],VI05[CALC_TIMES]; // 电流五次谐波

// 最终计算的值
static float Ua, Ub, Uc, U0;
static float Ia, Ib, Ic, I0;
static float UA, UC;
static float Udc1, Udc2;
static float Pa, Pb, Pc;
static float Qa, Qb, Qc;
//static float Sa, Sb, Sc;
//static float Fa, Fb, Fc;
static float Ua3,Ub3,Uc3,U03;
static float Ua5,Ub5,Uc5,U05;
static float UC3;
static float UC5;
static float Ia2,Ib2,Ic2;
static float Ia3,Ib3,Ic3,I03;
static float Ia5,Ib5,Ic5,I05;
static float P, Q, S, F;

/* PRIVATE FUNCTION PROTOTYPES -----------------------------------------------*/
/**
  * @brief  处理AD7606采样序列，添加虚部为0
  * @param  buf_from-输入序列.
  * @param  buf_to-输出序列.
  * @retval 无
  */
static void BufDiv(double *buf_from, float buf_to[CALC_TIMES][FFT_LENGTH * 2])
{
    unsigned char i, j;

    for (j = 0; j < CALC_TIMES; j++)
    {
        for (i = 0; i < FFT_LENGTH; i++)
        {
            buf_to[j][2 * i] = buf_from[i * 3 + j];
            buf_to[j][2 * i + 1] = 0;//虚部全为0
        }
    }
}
/**
  * @brief  求计算结果的中间值
  * @param  buf-输入数组
  * @param  n-长度
  * @retval 计算的中间值
  */
static float CalcAverage(float *buf, int n)
{
    int i, j;
    float temp;
    for (j = 0; j < n - 1; j++)
        for (i = 0; i < n - 1 - j; i++)
        {
            if (buf[i] > buf[i + 1])
            {
                temp = buf[i];
                buf[i] = buf[i + 1];
                buf[i + 1] = temp;
            }
        }
    return buf[1];
}

/**
  * @Description: 计算U与I间的夹角
  * @param:  imageU-电压虚部
  * @param:  floatU-电压实部
  * @param:  imageI-电压虚部
  * @param:  floatI-电压实部
  * @return: (radU - radI)-U与I之间的夹角
  * @updata: [YYYY-MM-DD] [更改人姓名][变更描述]
  */
static float CalculateAngleU_I(float imageU, float floatU, float imageI, float floatI)
{
    float angleU_I = 0;
    float radU_I = 0;
    int8_t  xU_I,yU_I,zU,zI = 0;

    if((floatU == 0)&&(floatI == 0))
    {
        radU_I = 0;
    }
    else if(floatU == 0)
    {
        radU_I = -3.1415926f/2;
    }
    else if(floatI == 0)
    {
        radU_I = 3.1415926f/2;
    }
    else
    {
        radU_I = atan(((imageU / floatU) - (imageI / floatI))/(1.0f + (imageU / floatU)*(imageI / floatI)));
    }

    yU_I = (imageU>=0 ? 1:-1) * (imageI>=0 ? 1:-1);
    xU_I = (floatU>=0 ? 1:-1) * (floatI>=0 ? 1:-1);
    zU = (imageU>=0 ? 1:-1) * (floatU>=0 ? 1:-1);
    zI = (imageI>=0 ? 1:-1) * (floatI>=0 ? 1:-1);

    if((xU_I>=0) && (yU_I>=0))//同象限
    {
        radU_I = (radU_I + 0.0f);
    }
    else if((xU_I<=0) && (yU_I<=0))//以U为基准，I超前2个象限
    {
        radU_I = (radU_I + 3.1415926f);
    }
    else if((xU_I>=0) && (yU_I<=0))//以U与I上下相邻象限
    {
        if((zU>0)|(zI<0))
        {
            if(radU_I<0)//以U为基准，I超前1个象限
            {
                radU_I = (radU_I + 3.1415926f);
            }
            else
            {
                radU_I = (radU_I + 0.0f);
            }
        }
        else
        {
            if(radU_I<0)//以U为基准，I超前3个象限
            {
                radU_I = (radU_I + 0.0f);
            }
            else
            {
                radU_I = (radU_I + 3.1415926f);	;
            }
        }
    }
    else if((xU_I<=0) && (yU_I>=0))//以U与I左右相邻象限
    {
        if((zU>0)|(zI<0))
        {
            if(radU_I<0)//以U为基准，I超前3个象限
            {
                radU_I = (radU_I + 0.0f);
            }
            else
            {
                radU_I = (radU_I + 3.1415926f);	;
            }
        }
        else
        {
            if(radU_I<0)//以U为基准，I超前1个象限
            {
                radU_I = (radU_I + 3.1415926f);
            }
            else
            {
                radU_I = (radU_I + 0.0f);
            }
        }
    }

    angleU_I = radU_I * FACTOR_RAD_TO_ANGLE;
	
//	angleU_I = angleU_I > 180 ? angleU_I - 360 : angleU_I;
//	angleU_I = angleU_I < (-180) ? angleU_I + 360 : angleU_I;

    return(angleU_I);
}

/**
  * @Description: 对AD7606采样值进行计算.
  * @param:  无
  * @return: 无
  * @updata: [YYYY-MM-DD] [更改人姓名][变更描述]
  */
static void CalculateData(void)
{
    int i;
    static rt_uint8_t k; 
    rt_uint8_t queue_temp;
    
    queue_temp = g_SampleQueueIn;
    
    if (queue_temp >= 2)
    {
        for (i =  0; i < 2 * ADC_SAMPLE_NUM; i++)
        {
            g_UaSampleBuf[i] = *(g_SampleQueueBuf->ua[queue_temp - 2]+i);
            g_UbSampleBuf[i] = *(g_SampleQueueBuf->ub[queue_temp - 2]+i);
            g_UcSampleBuf[i] = *(g_SampleQueueBuf->uc[queue_temp - 2]+i);
            g_U0SampleBuf[i] = *(g_SampleQueueBuf->u0[queue_temp - 2]+i);

            g_IaSampleBuf[i] = *(g_SampleQueueBuf->ia[queue_temp - 2]+i);
            g_IbSampleBuf[i] = *(g_SampleQueueBuf->ib[queue_temp - 2]+i);
            g_IcSampleBuf[i] = *(g_SampleQueueBuf->ic[queue_temp - 2]+i);
            g_I0SampleBuf[i] = *(g_SampleQueueBuf->i0[queue_temp - 2]+i);
            
            g_UASampleBuf[i] = *(g_SampleQueueBuf->uA[queue_temp - 2]+i);
            g_UCSampleBuf[i] = *(g_SampleQueueBuf->uC[queue_temp - 2]+i);
            g_Udc1SampleBuf[i] = *(g_SampleQueueBuf->udc1[queue_temp - 2]+i);
            g_Udc2SampleBuf[i] = *(g_SampleQueueBuf->udc2[queue_temp - 2]+i);
        }
    }
    else if (queue_temp == 0)
    {
        for (i =  0; i < 2 * ADC_SAMPLE_NUM; i++)
        {
            g_UaSampleBuf[i] = *(g_SampleQueueBuf->ua[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            g_UbSampleBuf[i] = *(g_SampleQueueBuf->ub[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            g_UcSampleBuf[i] = *(g_SampleQueueBuf->uc[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            g_U0SampleBuf[i] = *(g_SampleQueueBuf->u0[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);

            g_IaSampleBuf[i] = *(g_SampleQueueBuf->ia[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            g_IbSampleBuf[i] = *(g_SampleQueueBuf->ib[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            g_IcSampleBuf[i] = *(g_SampleQueueBuf->ic[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            g_I0SampleBuf[i] = *(g_SampleQueueBuf->i0[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            
            g_UASampleBuf[i] = *(g_SampleQueueBuf->uA[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            g_UCSampleBuf[i] = *(g_SampleQueueBuf->uC[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            g_Udc1SampleBuf[i] = *(g_SampleQueueBuf->udc1[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
            g_Udc2SampleBuf[i] = *(g_SampleQueueBuf->udc2[(ADC_WAVE_SEMP_NUM * 2) - 2]+i);
        }
    }
    else if (queue_temp == 1)
    {
        for (i = 0; i < ADC_SAMPLE_NUM; i++)
        {
            g_UaSampleBuf[i] = *(g_SampleQueueBuf->ua[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            g_UbSampleBuf[i] = *(g_SampleQueueBuf->ub[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            g_UcSampleBuf[i] = *(g_SampleQueueBuf->uc[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            g_U0SampleBuf[i] = *(g_SampleQueueBuf->u0[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);

            g_IaSampleBuf[i] = *(g_SampleQueueBuf->ia[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            g_IbSampleBuf[i] = *(g_SampleQueueBuf->ib[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            g_IcSampleBuf[i] = *(g_SampleQueueBuf->ic[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            g_I0SampleBuf[i] = *(g_SampleQueueBuf->i0[(ADC_WAVE_SEMP_NUM * 2) - 1]+i);
            
