xiaxquan/Tradition_DTU/FTU/bsp/stm32f429-apollo/applications/calculator/calculator.c
    Ub5 = CalcAverage(VUb5, CALC_TIMES) * VOLTAGE_RADIO;    
    U05 = CalcAverage(VU05, CALC_TIMES) * VOLTAGE_RADIO;

    Ia = CalcAverage(VIa, CALC_TIMES) * CURRENT_RADIO;
    Ib = CalcAverage(VIb, CALC_TIMES) * CURRENT_RADIO;
    Ic = CalcAverage(VIc, CALC_TIMES) * CURRENT_RADIO;
    I0 = CalcAverage(VI0, CALC_TIMES) * CURRENT_RADIO;

    //printf("%f  %f  %f\n", Ia,Ib,Uc);
    Ia2 = CalcAverage(VIa2, CALC_TIMES) * CURRENT_RADIO;
    Ib2 = CalcAverage(VIb2, CALC_TIMES) * CURRENT_RADIO;
    Ic2 = CalcAverage(VIc2, CALC_TIMES) * CURRENT_RADIO;
	
    Ia3 = CalcAverage(VIa3, CALC_TIMES) * CURRENT_RADIO;
    Ib3 = CalcAverage(VIb3, CALC_TIMES) * CURRENT_RADIO;
    Ic3 = CalcAverage(VIc3, CALC_TIMES) * CURRENT_RADIO;
    I03 = CalcAverage(VI03, CALC_TIMES) * CURRENT_RADIO;

    Ia5 = CalcAverage(VIa5, CALC_TIMES) * CURRENT_RADIO;
    Ib5 = CalcAverage(VIb5, CALC_TIMES) * CURRENT_RADIO;
    Ic5 = CalcAverage(VIc5, CALC_TIMES) * CURRENT_RADIO;
    I05 = CalcAverage(VI05, CALC_TIMES) * CURRENT_RADIO;
    
    UA = CalcAverage(VUA, CALC_TIMES) * VOLTAGE_RADIO;
    UC = CalcAverage(VUC, CALC_TIMES) * VOLTAGE_RADIO;

	for (i = 0; i < ADC_SAMPLE_NUM; i++)
	{
		Udc1 += g_Udc1SampleBuf[i];
		Udc2 += g_Udc2SampleBuf[i];
	}   
	
	Udc1 /= ADC_SAMPLE_NUM;
	Udc2 /= ADC_SAMPLE_NUM;

    Ua3 = Ua3 * g_CalibrateFactor[CALIFACTOR_Uab];
    Ua5 = Ua5 * g_CalibrateFactor[CALIFACTOR_Uab];
	
    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {
        Uc3 = Uc3 * g_CalibrateFactor[CALIFACTOR_Ucb];
        Uc5 = Uc5 * g_CalibrateFactor[CALIFACTOR_Ucb];
    }
    else
    {
        UC3 = UC3 * g_CalibrateFactor[CALIFACTOR_UCB];
        UC5 = UC5 * g_CalibrateFactor[CALIFACTOR_UCB];    
    }
        
    Ua = Ua * g_CalibrateFactor[CALIFACTOR_Uab];    
    Ub = Ub * g_CalibrateFactor[CALIFACTOR_Uac];
    Ub3 = Ub3 * g_CalibrateFactor[CALIFACTOR_Uac];
    Ub5 = Ub5 * g_CalibrateFactor[CALIFACTOR_Uac];    
    Uc = Uc * g_CalibrateFactor[CALIFACTOR_Ucb];     
    U0 = U0 * g_CalibrateFactor[CALIFACTOR_U0];
    U03 = U03 * g_CalibrateFactor[CALIFACTOR_U0];
    U05 = U05 * g_CalibrateFactor[CALIFACTOR_U0];    
    Ia = Ia * g_CalibrateFactor[CALIFACTOR_Ia];
	Ia2 = Ia2 * g_CalibrateFactor[CALIFACTOR_Ia];
    Ia3 = Ia3 * g_CalibrateFactor[CALIFACTOR_Ia];
    Ia5 = Ia5 * g_CalibrateFactor[CALIFACTOR_Ia];    
    Ib = Ib * g_CalibrateFactor[CALIFACTOR_Ib];
	Ib2 = Ib2 * g_CalibrateFactor[CALIFACTOR_Ib];
    Ib3 = Ib3 * g_CalibrateFactor[CALIFACTOR_Ib];
    Ib5 = Ib5 * g_CalibrateFactor[CALIFACTOR_Ib];    
    Ic = Ic * g_CalibrateFactor[CALIFACTOR_Ic];
	Ic2 = Ic2 * g_CalibrateFactor[CALIFACTOR_Ic];
    Ic3 = Ic3 * g_CalibrateFactor[CALIFACTOR_Ic];
    Ic5 = Ic5 * g_CalibrateFactor[CALIFACTOR_Ic];    
    I0 = I0 * g_CalibrateFactor[CALIFACTOR_I0];
    I03 = I03 * g_CalibrateFactor[CALIFACTOR_I0];
    I05 = I05 * g_CalibrateFactor[CALIFACTOR_I0];    
    UA = UA * g_CalibrateFactor[CALIFACTOR_UAB];
    UC = UC * g_CalibrateFactor[CALIFACTOR_UCB];   
    Udc1 = Udc1 * g_CalibrateFactor[CALIFACTOR_DC1];
    Udc2 = Udc2 * g_CalibrateFactor[CALIFACTOR_DC2];  

    if (Ua < g_Parameter[ZERODRIFT_Uab])Ua = 0;
    if (Ub < g_Parameter[ZERODRIFT_Uac])Ub = 0;
    if (Uc < g_Parameter[ZERODRIFT_Ucb])Uc = 0;
    if (U0 < g_Parameter[ZERODRIFT_U0]) U0 = 0;
    if (Ia < g_Parameter[ZERODRIFT_Ia]) Ia = 0;
    if (Ib < g_Parameter[ZERODRIFT_Ib]) Ib = 0;
    if (Ic < g_Parameter[ZERODRIFT_Ic]) Ic = 0;
    if (I0 < g_Parameter[ZERODRIFT_I0]) I0 = 0;
    if (UA < g_Parameter[ZERODRIFT_UAB])UA = 0;
    if (UC < g_Parameter[ZERODRIFT_UCB])UC = 0;
    if (Udc1 < g_Parameter[ZERODRIFT_DC1])Udc1 = 0;
    if (Udc2 < g_Parameter[ZERODRIFT_DC2])Udc2 = 0;
    
    Pa = Ua * Ia * cos(g_Alpha[ALPHA_UabIa] * FACTOR_ANGLE_TO_RAD);  
    Qa = Ua * Ia * sin(g_Alpha[ALPHA_UabIa] * FACTOR_ANGLE_TO_RAD);        
        
    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {  
        Pc = Uc * Ic * cos(g_Alpha[ALPHA_UcbIc] * FACTOR_ANGLE_TO_RAD);
        Qc = Uc * Ic * sin(g_Alpha[ALPHA_UcbIc] * FACTOR_ANGLE_TO_RAD);
    }
    else
    {
        Pc = UC * Ic * cos(g_Alpha[ALPHA_UcbIc] * FACTOR_ANGLE_TO_RAD);
        Qc = UC * Ic * sin(g_Alpha[ALPHA_UcbIc] * FACTOR_ANGLE_TO_RAD);    
    }
   
    Pb = 0; //Ub * Ib * cos(g_Alpha[1] * FACTOR_ANGLE_TO_RAD);
    P = (Pa + Pb + Pc) / 1000.0f;
   
    Qb = 0; //Ub * Ib * sin(g_Alpha[1] * FACTOR_ANGLE_TO_RAD);
    Q = (Qa + Qb + Qc) / 1000.0f;

    S = sqrt(P * P + Q * Q);
    F = P / S;
    if(((uint8_t)isnan(F) != 0)||((uint8_t)isinf(F) != 0))
    {F = 0;}

    P = fabs(P) < g_Parameter[ZERODRIFT_P] ? 0 : P;
    Q = fabs(Q) < g_Parameter[ZERODRIFT_Q] ? 0 : Q;
    S = fabs(S) < g_Parameter[ZERODRIFT_S] ? 0 : S;

    g_TelemetryBaseDB[g_TelemetryBaseAddr.Uab]= Ua;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.Ucb] = Uc;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.Uac] = Ub;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.U0] = U0;

    g_TelemetryBaseDB[g_TelemetryBaseAddr.UAB] = UA;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.UCB] = UC;
    
    g_TelemetryBaseDB[g_TelemetryBaseAddr.Ia] = Ia;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.Ib] = Ib;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.Ic] = Ic;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.I0] = I0;

    g_TelemetryBaseDB[g_TelemetryBaseAddr.P] = P;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.Q] = Q;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.S] = S;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.PF] = F;

	g_TelemetryBaseDB[g_TelemetryBaseAddr.DC1] = Udc1;
	g_TelemetryBaseDB[g_TelemetryBaseAddr.DC2] = Udc2;
    
    g_TelemetryBaseDB[g_TelemetryBaseAddr.alphy_Uab_Ia] = g_Alpha[ALPHA_UabIa];
    g_TelemetryBaseDB[g_TelemetryBaseAddr.alphy_Ucb_Ic] = g_Alpha[ALPHA_UcbIc];
	
    if((g_TelemetryBaseDB[g_TelemetryBaseAddr.U0] == 0)||(g_TelemetryBaseDB[g_TelemetryBaseAddr.I0] == 0))
    {g_TelemetryBaseDB[g_TelemetryBaseAddr.alphy_U0_I0] = 0;}
    else       
    {
        while(g_Alpha[ALPHA_U0I0]<-180)
        {g_Alpha[ALPHA_U0I0] += 360;}
        while(g_Alpha[ALPHA_U0I0]>180)
        {g_Alpha[ALPHA_U0I0] -= 360;}
        g_TelemetryBaseDB[g_TelemetryBaseAddr.alphy_U0_I0] = g_Alpha[ALPHA_U0I0];
    }

    if((g_TelemetryBaseDB[g_TelemetryBaseAddr.Uab] == 0)||\
        (((g_Parameter[CFG_PRO_VOL_N] == 0)&&(g_TelemetryBaseDB[g_TelemetryBaseAddr.UAB] == 0))||\
        ((g_Parameter[CFG_PRO_VOL_N] == 1)&&(g_TelemetryBaseDB[g_TelemetryBaseAddr.UCB] == 0))))
    {g_TelemetryBaseDB[g_TelemetryBaseAddr.alphy_Ux_Ux] = 0;}
    else       
    {
        if(g_Alpha[ALPHA_UxUx]<-180)
        {g_Alpha[ALPHA_UxUx] += 360;}
        if(g_Alpha[ALPHA_UxUx]>180)
        {g_Alpha[ALPHA_UxUx] -= 360;}
        g_TelemetryBaseDB[g_TelemetryBaseAddr.alphy_Ux_Ux] = g_Alpha[ALPHA_UxUx];
    }
	
    g_TelemetryBaseDB[g_TelemetryBaseAddr.UabOnce] = Ua * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.UbcOnce] = Uc * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.UcaOnce] = Ub * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.U0Once] = U0 * (g_Parameter[RATIO_U0_ONE_TURN] / g_Parameter[RATIO_U0_SECONDARY]) / 1000.0f;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.UBCOnce] = UC * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.UABOnce] = UA * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) / 1000.0f;
	
    g_TelemetryBaseDB[g_TelemetryBaseAddr.IaOnce] = Ia * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryBaseDB[g_TelemetryBaseAddr.IbOnce] = Ib * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);    
    g_TelemetryBaseDB[g_TelemetryBaseAddr.IcOnce] = Ic * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryBaseDB[g_TelemetryBaseAddr.I0Once] = I0 * (g_Parameter[RATIO_I0_ONE_TURN] / g_Parameter[RATIO_I0_SECONDARY]);

    g_TelemetryBaseDB[g_TelemetryBaseAddr.POnce] = P * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryBaseDB[g_TelemetryBaseAddr.QOnce] = Q * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);
    g_TelemetryBaseDB[g_TelemetryBaseAddr.SOnce] = S * (g_Parameter[RATIO_U_ONE_TURN] / g_Parameter[RATIO_U_SECONDARY]) * (g_Parameter[RATIO_I_ONE_TURN] / g_Parameter[RATIO_I_SECONDARY]);

    if (Ua3 < g_Parameter[ZERODRIFT_Uab])Ua3 = 0;
    if (Ua5 < g_Parameter[ZERODRIFT_Uab])Ua5 = 0;

    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {
        if (Uc3 < g_Parameter[ZERODRIFT_Ucb])Uc3 = 0;
        if (Uc5 < g_Parameter[ZERODRIFT_Ucb])Uc5 = 0;
    }
    else
    {
        if (UC3 < g_Parameter[ZERODRIFT_Ucb])UC3 = 0;
        if (UC5 < g_Parameter[ZERODRIFT_Ucb])UC5 = 0;
    }
        
