xiaxquan/Tradition_DTU/FTU/bsp/stm32f429-apollo/applications/calculator/calculator.c
    if (Ub3 < g_Parameter[ZERODRIFT_Uac])Ub3 = 0;    
    if (U03 < g_Parameter[ZERODRIFT_U0]) U03 = 0;
    	
	if (Ia2 < g_Parameter[ZERODRIFT_Ia]) Ia2 = 0;
	if (Ib2 < g_Parameter[ZERODRIFT_Ib]) Ib2 = 0;
	if (Ic2 < g_Parameter[ZERODRIFT_Ic]) Ic2 = 0;
	
    if (Ia3 < g_Parameter[ZERODRIFT_Ia]) Ia3 = 0;
    if (Ib3 < g_Parameter[ZERODRIFT_Ib]) Ib3 = 0;
    if (Ic3 < g_Parameter[ZERODRIFT_Ic]) Ic3 = 0;
    if (I03 < g_Parameter[ZERODRIFT_I0]) I03 = 0;

    
    if (Ub5 < g_Parameter[ZERODRIFT_Uac])Ub5 = 0;    
    if (U05 < g_Parameter[ZERODRIFT_U0]) U05 = 0;
    if (Ia5 < g_Parameter[ZERODRIFT_Ia]) Ia5 = 0;
    if (Ib5 < g_Parameter[ZERODRIFT_Ib]) Ib5 = 0;
    if (Ic5 < g_Parameter[ZERODRIFT_Ic]) Ic5 = 0;
    if (I05 < g_Parameter[ZERODRIFT_I0]) I05 = 0;
    
    g_secondHarmonicIa = Ia2;
	g_secondHarmonicIb = Ib2;
	g_secondHarmonicIc = Ic2;

    g_TelemetryBaseDB[g_TelemetryBaseAddr.thirdharmonicUab] = Ua3; 
    g_TelemetryBaseDB[g_TelemetryBaseAddr.fifthharmonicUab] = Ua5;

    if(g_Parameter[CFG_POW_VOL_CB] == 0)
    {
        g_TelemetryBaseDB[g_TelemetryBaseAddr.thirdharmonicUbc] = Uc3;
        g_TelemetryBaseDB[g_TelemetryBaseAddr.fifthharmonicUbc] = Uc5;
    }
    else
    {
        g_TelemetryBaseDB[g_TelemetryBaseAddr.thirdharmonicUbc] = UC3;
        g_TelemetryBaseDB[g_TelemetryBaseAddr.fifthharmonicUbc] = UC5;    
    }
            
    g_TelemetryBaseDB[g_TelemetryBaseAddr.thirdharmonicUca] = Ub3;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.thirdharmonicU0] = U03;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.thirdharmonicIa] = Ia3;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.thirdharmonicIb] = Ib3;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.thirdharmonicIc] = Ic3;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.thirdharmonicI0] = I03;
    
    g_TelemetryBaseDB[g_TelemetryBaseAddr.fifthharmonicUca] = Ub5;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.fifthharmonicU0] = U05;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.fifthharmonicIa] = Ia5;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.fifthharmonicIb] = Ib5;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.fifthharmonicIc] = Ic5;
    g_TelemetryBaseDB[g_TelemetryBaseAddr.fifthharmonicI0] = I05;
    
#if RT_USING_TELEMETRY_SET    
    for (i = 0; i < TELEMETRY_TOTAL_NUM; i++)
    {
        if (g_TelemetrySetEnable[i] == SWITCH_ON)
        {
            g_TelemetryBaseDB[i] = g_TelemetrySetValue[i];
        }
    }
#endif /* RT_USING_TELEMETRY_SET */ 
}


/* PUBLIC FUNCTION PROTOTYPES ------------------------------------------------*/
/**
  * @Description: AD7606采样值初始化.
  * @param:  无
  * @return: 无
  */
int calculate_init(void)
{
    arm_cfft_radix2_init_f32(&Scfft, 32, 0, 1); // 初始化Scfft结构体
    	
    return(RT_EOK);     
}
INIT_BOARD_EXPORT(calculate_init);

/**
  * @Description: 计算任务.
  * @param:  无
  * @return: 无
  * @updata: [YYYY-MM-DD] [更改人姓名][变更描述]
  */
void CalcultateTask(void)
{
    CalculateData();

    /* 系数校准 */
    CalibrationFactorCal(g_CalibrateFactorCfg_Len);
}

/* END OF FILE ---------------------------------------------------------------*/
